# Задача для самостоятельного решения. В списке хранятся числа. Нужно выбрать только чётные числа и составить
# список пар (число; квадрат числа). Пример: 2 3 7 1 5 13 17 22 38  Получить: [(2, 4), (22, 484), (38, 1444)]

data = [2, 3, 7, 1, 5, 13, 17, 22, 38]
print(data)
res = list()
for i in data:
    if i % 2 == 0:
        res.append((i, i**2))
print(res)





