# Задача: C клавиатуры вводится некий набор чисел, в качестве разделителя
# используется пробел. Этот набор чисел будет считан в качестве строки. Как
# превратить list строк в list чисел?

list_1 = '4 8 2 3 14 17 22 21 35 48 71'
print(list_1)
print(list_1.split())
list_1 = list(map(int, list_1.split()))
print(list_1)

